[
    {"p1" : "I recently graduated from Flatiron School’s Software Engineering program with a working knowledge of JavaScript, Python, the library React.js, the micro-framework Flask and a smattering of SQL.  Even though my background is in a visual medium, I find that I am more attracted to Python and more back-end development, so I’m also learning what I can about Java.  This site on the surface, however, belies that notion, but is simply meant to be an example of my development, but even more so, my intent and ability to pick up new things. New things such as creating my own custom context and hooks in React, something that Flatiron did not teach us, but I wanted to try to see if I could…."
    },
    {"p2" : "I was born in San Jose, the heart of Silicon Valley, but I chose to leave and finish my studies at RIT (Rochester Institute of Technology) - not to study computer science - but instead photography.  I liked the school when I toured it during a solo cross country road trip, and after spending most of my early years growing up in Kenya, I was also interested in finding out what it was like to live somewhere snow actually fell from the skies.  In addition, I knew I wanted to move to New York City, so once I graduated, I moved to Queens, NY, and promoted myself to photographers whose work I liked and started working as an assistant.  After a few years, I found myself gravitating toward the computer and working as a Digital Technician (aka Digi Tech), and therefore defaulting to act as the resident tech person on sets full of artists.  As a result, turning to software development seemed to be a natural segue."
    },
    {"p3" : "I currently live in Park Slope, Brooklyn with Sarah, my wife and 2 very active boys - Makai, 5 1/2 years old and Paxton, 2 1/2 years old, and even though we don’t own a dog currently, we enjoy dog sitting for our friends and neighbors!  Since we live in New York City, I’m writing this at my desk in my ‘office’ which is really my desk on one wall of our living room… This is where while working, I attempt to dodge flying toy monster trucks but not dodge the occasional run-by hug.  This is with the intent to at some point not be in the middle of their monster truck arena and be in the company of my colleagues where hopefully I will not have to dodge flying monster trucks! :-)]"
    }
]
